# Pre-Procesamiento de datos: Desercion Universidad de Boyaca

# 1. Cargando tablas e informacion general

In [13]:
# importar pandas
import pandas as pd

In [39]:
docentes_periodo_df = pd.read_csv('../data/raw/docentes_periodo.csv', ';', encoding='ISO-8859-1')
eval_docentes_periodo_df = pd.read_csv('../data/raw/eval_docentes_periodo.csv', ';', encoding='ISO-8859-1')
mat_cursadas_df = pd.read_csv('../data/raw/mat_cursadas_rend_academico.csv', ';', encoding='ISO-8859-1')
perfil_ingreso_df = pd.read_csv('../data/raw/perfil_ingreso.csv', ';')
rendimiento_academico_df = pd.read_csv('../data/raw/rendimiento_academico.csv', ';', encoding='ISO-8859-1')
rendimiento_academico_df = pd.read_csv('../data/raw/rendimiento_academico.csv', ';', encoding='ISO-8859-1')

area_icfes_df = pd.read_excel('../data/raw/area_icfes.xlsx')
creditos_periodo_df = pd.read_excel('../data/raw/CREDITOS_PERIODO.xlsx')
perfil_ingreso_v2_df = pd.read_excel('../data/raw/perfil_ingreso_v2.xlsx')
materias_por_programa_df = pd.read_excel('../data/raw/materias_por_programa.xlsx')
pre_correquisito_df = pd.read_excel('../data/raw/pre_correquisito.xlsx')
mat_cursadas_v2_df = pd.read_excel('../data/raw/mat_cursadas_rend_academico_v2.xlsx')
reingreso_aplazamiento_df = pd.read_excel('../data/raw/reingreso_aplazamiento.xlsx')

In [25]:
# vistazo de las tablas
print("\n"+"docentes_periodo".center(90))
display(docentes_periodo_df.head(3))
print("\n"+"eval_docentes_periodo".center(90))
display(eval_docentes_periodo_df.head(3))
print("\n"+"mat_cursadas".center(90))
display(mat_cursadas_df.head(3))
print("\n"+"perfil_ingreso_df".center(90))
display(perfil_ingreso_df.head(3))
print("\n"+"rendimiento_academico".center(90))
display(rendimiento_academico_df.head(3))

print("\n"+"area_icfes".center(90))
display(area_icfes_df.head(3))
print("\n"+"creditos_periodo".center(90))
display(creditos_periodo_df.head(3))
print("\n"+"perfil_ingreso_v2".center(90))
display(perfil_ingreso_v2_df.head(3))
print("\n"+"materias_por_programa".center(90))
display(materias_por_programa_df.head(3))
print("\n"+"pre_correquisito".center(90))
display(pre_correquisito_df.head(3))
print("\n"+"mat_cursadas_v2".center(90))
display(mat_cursadas_v2_df.head(3))
print("\n"+"reingreso_aplazamiento".center(90))
display(reingreso_aplazamiento_df.head(3))

                                     docentes_periodo

   PERIODO  COD_MAT  COD_DOCENTE
0   201210    11303         1329
1   201210    11304         3111
2   201210    11305          622

                                  eval_docentes_periodo

,PERIODO,COD_DOCENTE,COD_MAT,COD_FACTOR,NOM_FACTOR,CALIFICACION
0,201210,1008,66410,1,Asistencia y Puntualidad,"4,63"
1,201210,1008,66410,2,Relación profesor alumno,"4,65"
2,201210,1008,66410,3,Orientación del proceso de formación,"4,58"

                                       mat_cursadas

,PERIODO_COHORTE,PERIODO_ACADEMICO,CODIGO,TOT_MAT_INSCRITAS,MAT_APROBADAS
0,201210,201210,11312001,8,7
1,201210,201210,11312002,8,7
2,201210,201210,11312003,8,7

                                    perfil_ingreso_df

,PERIODO_COHORTE,CODIGO,GENERO,EDAD,COLEGIO_PROCEDENCIA,PUNT_TOTAL,PUNT_AREA,ES_DESERTOR
0,201210,11312001,M,22.0,COL COOP COOSERVICIOS,438,49,NO
1,201210,11312002,M,23.0,INSTITUTO DE EDUCACION MEDIA DIVERSIFICADA INE...,386,48,NO
2,201210,11312003,F,22.0,I.E. ANTONIO NARI�O,460,51,NO

                                  rendimiento_academico

,PERIODO_COHORTE,PERIODO_ACADEMICO,CODIGO,COD_MAT,NOMBRE_MAT,NOTA_DEF,ESTADO
0,201210,201210,11312001,11305,EXP. ORAL ESCRITA,"3,50",APROBADA
1,201210,201210,11312001,11312,INICIATIVA EMPRES,"4,00",APROBADA
2,201210,201210,11312001,11310,MICROECONOMÍA,"3,60",APROBADA

                                        area_icfes

  FECHA_INI_EX FECHA_FIN_EX  COD_MEN          AREA_ICFES
0   1980-05-01   1999-12-31    20697  CIENCIAS NATURALES
1   1980-05-01   1999-12-31    20697            LENGUAJE
2   1980-05-01   1999-12-31    20697          MATEMÁTICA

                                     creditos_periodo

     CODIGO  PERIODO
0  33111541   201210
1  66411591   201210
2  33103565   201210

                                    perfil_ingreso_v2

,PERIODO_COHORTE,CODIGO,GENERO,EDAD,COLEGIO_PROCEDENCIA,PUNT_TOTAL,PUNT_AREA,ES_DESERTOR,ULTIMA_MATRICULA,COD_MEN
0,201210,11312001,M,22.0,COL COOP COOSERVICIOS,438,49,NO,201710,20708
1,201210,11312002,M,23.0,INSTITUTO DE EDUCACION MEDIA DIVERSIFICADA INE...,386,48,NO,201420,20708
2,201210,11312003,F,22.0,I.E. ANTONIO NARIÑO,460,51,NO,201620,20708

                                  materias_por_programa

,COD_MEN,FACULTAD,NOMBRE_PROGRAMA,ACREDITADO,SEDE,COD_MAT,NUM_CREDITOS,INTRODUCCION
0,20708,FACULTAD DE CIENCIAS ADMINISTRATIVAS Y CONTABLES,ADMINISTRACIÓN DE EMPRESAS,N.A.,SEDE TUNJA,11330,2,NO
1,20708,FACULTAD DE CIENCIAS ADMINISTRATIVAS Y CONTABLES,ADMINISTRACIÓN DE EMPRESAS,N.A.,SEDE TUNJA,11329,2,NO
2,20708,FACULTAD DE CIENCIAS ADMINISTRATIVAS Y CONTABLES,ADMINISTRACIÓN DE EMPRESAS,N.A.,SEDE TUNJA,11334,2,NO

                                     pre_correquisito

,COD_BASE,NOMBRE_MAT,COD_PRECO,NOMBRE_PRECORREQUISITO,TIPO_REQUISITO
0,11304,PLANEACIÓN Y CONTROL,11313,ADMINISTRACIÓN BÁSICA,PRERREQUISITO
1,11308,CÁLCULO DIFERENCIAL,11301,MATEMÁTICA BÁSICA,PRERREQUISITO
2,11309,CONTABILIDAD COMERCIAL,11311,CONTABILIDAD BÁSICA,PRERREQUISITO

                                     mat_cursadas_v2

,PERIODO_COHORTE,PERIODO_ACADEMICO,CODIGO,TOT_MAT_INSCRITAS,CRED_INSCRITOS,MAT_APROBADAS,CRED_APROBADOS
0,201210,201210,11312001,8,17.0,7,15.0
1,201210,201210,11312002,8,16.0,7,14.0
2,201210,201210,11312003,8,17.0,7,15.0

                                  reingreso_aplazamiento

     CODIGO FECHA_SOLICITUD       TIPO
0  55110503      2012-01-10  REINGRESO
1  55510048      2012-01-10  REINGRESO
2  55510535      2012-01-10  REINGRESO

## 2. Tabla "docentes_periodo"

### Tipos de datos:

In [26]:
docentes_periodo_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32537 entries, 0 to 32536
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PERIODO      32537 non-null  int64
 1   COD_MAT      32537 non-null  int64
 2   COD_DOCENTE  32537 non-null  int64
dtypes: int64(3)
memory usage: 762.7 KB

> los codigos deben ser variables categoricas no enteros, asi que debemos convertirlos a strings:

In [46]:
# funcion util convertir  a strings:

def as_string(df, columns):
    """Convierte el tipo de dato de las columnas especificadas a string

    Args:
        df: el dataframe a modificar sus columnas
        columns (list): lista de strings con el nombre de las columnas a convertir
    
    Return:
        copia del dataframe modificado
    """
    df = df[columns].astype(str)
    
    return df

In [48]:
# docentes_periodo_df.astype({'PERIODO':str, 'COD_MAT':str, 'COD_DOCENTE':str})
docentes_periodo_df = as_string(docentes_periodo_df, columns=['PERIODO', 'COD_MAT', 'COD_DOCENTE'])
docentes_periodo_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32537 entries, 0 to 32536
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PERIODO      32537 non-null  object
 1   COD_MAT      32537 non-null  object
 2   COD_DOCENTE  32537 non-null  object
dtypes: object(3)
memory usage: 762.7+ KB

### Agregar columna año y semestre:

In [56]:
docentes_periodo_df['año'] = docentes_periodo_df.PERIODO.str.slice(0,4)
docentes_periodo_df['semestre'] = docentes_periodo_df.PERIODO.str.slice(4).map({'10':'semeste 1',
                                                                                '20':'semestre 2',
                                                                                '11':'intersemestral 1',
                                                                                '21':'intersemestral 2'})
docentes_periodo_df.head(3)

  PERIODO COD_MAT COD_DOCENTE   año   semestre
0  201210   11303        1329  2012  semeste 1
1  201210   11304        3111  2012  semeste 1
2  201210   11305         622  2012  semeste 1

### Mas informacion general

In [57]:
# Dimensiones del dataframe:
print(f'\nnumero de filas = {docentes_periodo_df.shape[0]}\nnumero de columnas = {docentes_periodo_df.shape[1]}')
# describcion general del dataframe:
docentes_periodo_df.describe(include='all')

numero de filas = 32537
numero de columnas = 5

       PERIODO COD_MAT COD_DOCENTE    año   semestre
count    32537   32537       32537  32537      32537
unique      37    2275        2220     10          4
top     201620   77224        2442   2017  semeste 1
freq      1986     264         158   3901      16842

In [65]:
display(docentes_periodo_df.PERIODO.isna().value_counts())
display(docentes_periodo_df.COD_DOCENTE.isna().value_counts())
display(docentes_periodo_df.COD_MAT.isna().value_counts())

False    32537
Name: PERIODO, dtype: int64

False    32537
Name: COD_DOCENTE, dtype: int64

False    32537
Name: COD_MAT, dtype: int64

### Parece que los valores de "COD_DOCENTE" deben ser de 4 digitos, tenemos que verificarlo

In [8]:
print(f'Numero de COD_DOCENTE con menos de 4 digitos: {len(df.COD_DOCENTE[df.COD_DOCENTE.apply(len)<4])}')
print(f'Numero de COD_DOCENTE con mas de 4 digitos: {len(df.COD_DOCENTE[df.COD_DOCENTE.apply(len)>4])}')
print(f'Numero de COD_DOCENTE con exactamente 4 digitos: {len(df.COD_DOCENTE[df.COD_DOCENTE.apply(len)==4])}')

Numero de COD_DOCENTE con menos de 4 digitos: 3404
Numero de COD_DOCENTE con mas de 4 digitos: 0
Numero de COD_DOCENTE con exactamente 4 digitos: 29133

> La mayoria tienen 4 digitos, unos pocos tienen menos

In [9]:
len(df.COD_DOCENTE.unique())

2220

> Hay 2200 valores unicos para "COD_DOCENTE"

Rellenamos con ceros a la izquierda para tener consistencia en cuanto a el numero de digitos, ademas verificamos que se mantiene el mismo numero de valores unicos:

In [11]:
df.COD_DOCENTE = df.COD_DOCENTE.str.zfill(4)
print(f'Numero de COD_DOCENTE con exactamente 4 digitos: {len(df.COD_DOCENTE[df.COD_DOCENTE.apply(len)==4])}')
len(df.COD_DOCENTE.unique())

Numero de COD_DOCENTE con exactamente 4 digitos: 32537

2220

In [7]:
# Parece que los peirodos deben ser de 6 digitos, tenemos que verificarlo
print(f'Codigo de PERIODO con menos de 6 digitos: {len(df.PERIODO[df.PERIODO.apply(len)<6])}')
print(f'Codigo de PERIODO con mas de 6 digitos: {len(df.PERIODO[df.PERIODO.apply(len)>6])}')
print(f'Codigo de PERIODO con exactamente 6 digitos: {len(df.PERIODO[df.PERIODO.apply(len)==6])}') # estan todos bien

Codigo de PERIODO con menos de 6 digitos: 0
Codigo de PERIODO con mas de 6 digitos: 0
Codigo de PERIODO con exactamente 6 digitos: 32537

In [101]:
len(df.COD_MAT[df.COD_MAT.apply(len)==6])

32537

In [99]:
filtro_6_digitos = df.COD_MAT.apply(len) == 6 # lista de falsos y verdaderos
cod_6_digitos = df.COD_MAT[filtro_6_digitos] # aplicar filtro (obtenemos las filas correspondientes a los verdaderos)
filt_starts_0 = cod_6_digitos.str.startswith('0')
cod_6_digitos[filt_starts_0]

Series([], Name: COD_MAT, dtype: object)

In [100]:
df.COD_MAT = df.COD_MAT.str.zfill(6)

In [32]:
num_filas = df.shape[0]

In [36]:
print(f'PERIODO: Numero Total de filas: {num_filas}, filas no vacias: {df.PERIODO.count()}')
print(f'COD_MAT: Numero Total de filas: {num_filas}, filas no vacias: {df.COD_MAT.count()}')
print(f'COD_DOCENTE: Numero Total de filas: {num_filas}, filas no vacias: {df.COD_DOCENTE.count()}')

PERIODO: Numero Total de filas: 32537, filas no vacias: 32537
COD_MAT: Numero Total de filas: 32537, filas no vacias: 32537
COD_DOCENTE: Numero Total de filas: 32537, filas no vacias: 32537

In [80]:
df.COD_DOCENTE.sort_values()

2926     0000
2925     0000
2923     0000
2922     0000
1676     0000
         ...
31794    5708
31835    5708
31875    5711
31937    5713
31938    5714
Name: COD_DOCENTE, Length: 32537, dtype: object

In [83]:
len(df.COD_DOCENTE.unique())

2220

In [48]:
df.groupby(['PERIODO','COD_MAT']).count().sort_values(by = 'COD_DOCENTE')

                 COD_DOCENTE
PERIODO COD_MAT
201210  11303              1
201720  66365              1
        66364              1
        66363              1
        66362              1
...                      ...
        88146             18
201910  66441             18
201820  66441             18
201810  66441             18
202010  88146             20

[23971 rows x 1 columns]

In [57]:
dato = int('0011')
dato

11

In [58]:
str(dato)

'11'

## 2. Tabla "eval_docentes_periodo"

In [66]:
eval_docentes_periodo_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 253035 entries, 0 to 253034
Data columns (total 6 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   PERIODO       253035 non-null  int64
 1   COD_DOCENTE   253035 non-null  int64
 2   COD_MAT       253035 non-null  int64
 3   COD_FACTOR    253035 non-null  int64
 4   NOM_FACTOR    253035 non-null  object
 5   CALIFICACION  253035 non-null  object
dtypes: int64(4), object(2)
memory usage: 11.6+ MB